#+title: org-babel notes
#+hugo_base_dir: /home/awannaphasch2016/org/projects/sideprojects/website/my-website/hugo/quickstart
#+FILETAGS: org-babel notes

[[id:0605f0e7-f67b-4e05-add5-283238d8e50c][test]]

* Blog :blog:
** X implementation where X = executing org babel block in Doom Emacs. :implementation:doom:org_babel:
:PROPERTIES:
:ID:       e9759471-8dc9-4d95-ac1e-a691c4e44ce2
:EXPORT_FILE_NAME: X implementation where X = executing org babel block in Doom Emacs.
:END:
- Editing History
  - [2022-07-06 Wed]
  - Last edit is on [2022-07-07 Thu]

This article investigates what is executed when one presses =enter= to execute org babel source block in Doom Emacs.

Pressing =enter= in org-babel block will execute ~+org/dwim-at-point~, see code below for reference.
First, it checks if ~point~ is on a button. Then, it proceeds to assign evaluated output of ~org-element-context~ and ~org-element-type~.

#+BEGIN_SRC emacs-lisp :noeval
(+org/dwim-at-point *optional ARG)
  ...
  (if (button-at (point))
      (call-interactively #'push-button)
    (let* ((context (org-element-context))
           (type (org-element-type context)))
      ;; skip over unimportant contexts
      (while (and context (memq type '(verbatim code bold italic underline strike-through subscript superscript)))
        (setq context (org-element-property :parent context)
              type (org-element-type context)))
      (pcase type
        ...
        ((or `src-block `inline-src-block)
         (org-babel-execute-src-block arg))
#+END_SRC

~org-element-context~ returns smallest element or object around point as =(TYPE PROPS)=. Possible types are defined in ~org-element-all-elements~ and ~org-element-all-objects~.

PROPS, short for properties, depends on element or object type, but always have information about surrounded context and location of the element including =:begin=, =:end=, =:parent= and =:post-blank=. It is important to note here that Emacs is designed to assign set of properties to every characters in a buffer. ~org-element-context~ makes use of this concept. Information of ~org-element-all-objects~ and ~org-element-all-elements~ are provided below.

#+BEGIN_SRC emacs-lisp
(print org-element-all-objects)
#+END_SRC

#+RESULTS:
| bold | citation | citation-reference | code | entity | export-snippet | footnote-reference | inline-babel-call | inline-src-block | italic | line-break | latex-fragment | link | macro | radio-target | statistics-cookie | strike-through | subscript | superscript | table-cell | target | timestamp | underline | verbatim |


#+BEGIN_SRC emacs-lisp
(print org-element-all-elements)
#+END_SRC

#+RESULTS:
| babel-call | center-block | clock | comment | comment-block | diary-sexp | drawer | dynamic-block | example-block | export-block | fixed-width | footnote-definition | headline | horizontal-rule | inlinetask | item | keyword | latex-environment | node-property | paragraph | plain-list | planning | property-drawer | quote-block | section | special-block | src-block | table | table-row | verse-block |

~org-element-context~ simply tries to get =element=, its type, and its position, then process elements based on its type and position and output =(TYPE PROPS)=. One can think of ~org-element-context~ as a function that "repackage" information of org-element into certain format.
#+BEGIN_SRC emacs-lisp :noeval
...
     (let* ((pos (point))
	    (element (or element (org-element-at-point)))
	    (type (org-element-type element))
	    (post (org-element-property :post-affiliated element)))
      (cond
       ;; posscess element based on its type and position.
       ... ))
..
#+END_SRC

Running ~org-element-context~ inside org-babel block, I get the following.
#+BEGIN_SRC emacs-lisp
(src-block
 (:language "python" :switches nil :parameters nil :begin 171 :end 213 :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "print('hi')
" :post-blank 1 :post-affiliated 171 :mode nil :granularity element :org-element--cache-sync-key
(863 . 171)
:cached t :parent
(section
 (:begin 1 :end 232 :contents-begin 1 :contents-end 231 :robust-begin 1 :robust-end 229 :post-blank 1 :post-affiliated 1 :mode first-section :granularity element :org-element--cache-sync-key
  (863 . 0)
  :cached t :parent
  (org-data
   (:begin 1 :contents-begin 1 :contents-end 2408 :end 2408 :robust-begin 3 :robust-end 2406 :post-blank 0 :post-affiliated 1 :path "/home/awannaphasch2016/Scratches/tmp1.org" :mode org-data :CATEGORY "tmp1" :parent nil :cached t :org-element--cache-sync-key
    (803 . -1152921504606846885)))))))
#+END_SRC

Next, if an element's type is either =src-block= or =inline-src-block=, ~org-babel-execute-src-block~ is executed.
#+BEGIN_SRC emacs-lisp
...
        ((or `src-block `inline-src-block)
         (org-babel-execute-src-block arg))
..
#+END_SRC

Similar to ~org-element-context~, ~org-babel-execute-src-block~ gathers information specific to =org-babel= (e.g ~org-babel-get-src-block-info~). More specifically, org-babel related information is source block's location, header, and language. Once information is assigned to variables, the function just compute based on provided information.

#+name: org_babel_execute_src_block_src
#+BEGIN_SRC emacs-lisp
(defun org-babel-execute-src-block (&optional arg info params)
  ...
  (interactive)
  (let* ((org-babel-current-src-block-location
	  (or org-babel-current-src-block-location
	      (nth 5 info)
	      (org-babel-where-is-src-block-head)))
	 (info (if info (copy-tree info) (org-babel-get-src-block-info))))

    (cl-callf org-babel-merge-params (nth 2 info) params)
    (when (org-babel-check-evaluate info)
      (cl-callf org-babel-process-params (nth 2 info))
      (let* ((params (nth 2 info))
	     (cache (let ((c (cdr (assq :cache params))))
		      (and (not arg) c (string= "yes" c))))
	     (new-hash (and cache (org-babel-sha1-hash info :eval)))
	     (old-hash (and cache (org-babel-current-result-hash)))
	     (current-cache (and new-hash (equal new-hash old-hash))))
	(cond
    ...))))
  ...
)
#+END_SRC

=org-babel-current-src-block-location= is assigned value only in ~org-babel-exp-results~ which is used to prepare result to be export from org file. So, in this case, =org-babel-current-src-block-location= is nil. ref:org_babel_execute_src_block_src says if =org-babel-current-src-block-location= is nil, fall back on value of ~(nth 5 info)~ then fall back to ~(org-babel-where-is-src-block-head)~. I think the fallback method is there to increase efficiency because if fallback methods are expected to do the same thing, according to descriptions, and fallback methods involve more computation.

#+BEGIN_SRC emacs-lisp :cache
(org-babel-get-src-block-info)
#+END_SRC

#+RESULTS:
| emacs-lisp | (org-babel-get-src-block-info) | ((:colname-names) (:rowname-names) (:result-params both) (:result-type . value) (:results . both) (:exports . both) (:lexical . no) (:pandoc . t) (:kernel . python3) (:eval . never-export) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . jupyter-python)) |   | nil | 4959 | (ref:%s) |

Command is interned from =org-babel-execute:= prefix followed by lang.
#+BEGIN_SRC emacs-lisp
(cmd (intern (concat "org-babel-execute:" lang)))
#+END_SRC

In ref:org_babel_execute_src_block_src, I find implementation of caching results interesting in that it uses hash of "info of org babel source" to determined if there is any change to the block since last run. block will be recomputed only if "info of org babel source" has changed. This is done by comparing new hash of old hash as followed.
#+BEGIN_SRC emacs-lisp
...
	     (new-hash (and cache (org-babel-sha1-hash info :eval)))
	     (old-hash (and cache (org-babel-current-result-hash)))
	     (current-cache (and new-hash (equal new-hash old-hash)))
...
#+END_SRC


Lastly, it expand noweb body (~org-babel--expand-body~), evaluate body, insert result (~org-babel-insert-result~), and run hook (~(run-hook 'org-babel-after-execute-hook')~).

That's all for code structure of computing source block. The rest is just detail which is better to learn when you really need it.

I haven't explored caching mechanism. This should be an interesting post in itself.

That's it.
Peace.


* Project build by org-babel
** [[file:~/org/projects/sideprojects/website/my-website/org-mode.org::To rebuild the website run, the following][building my own website with org-babel and literate programming]]

* Writing literate programming with org-babel
** references
:PROPERTIES:
:ID:       6371c96d-34ad-4e70-9f2f-9bb133b89fdc
:END:
*** [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][Introduction to literate programming with org-mode and org-babel by howard]]
:PROPERTIES:
:ID:       cbc7899f-90d5-451e-a479-d69a8e3aa4d2
:END:

* Keybinding and command
| commands                            | key       | doom keys | custom keys | descriptions                                                               |
| org-babel-result-hide-all           |           |           |             | hide all org babel result block                                            |
| org-hide-block-all                  |           |           |             | Fold all source blocks in the current buffer                               |
| org-babel-remove-result-one-or-many | c-c c-v k |           |             | remove all results blocks                                                  |
| org-babel-logb-ingest               | C-c C-v i |           |             | Add all named source blocks defined in FILE to org-babel-library-of-babel. |
| org-babel-demarcate-block           |           |           |             | org babel split block into two                                             |
| org-babel-insert-header-arg         | c-c c-v j |           |             |                                                                            |
* using results from one code block in another org-mode
ref: https://kitchingroup.cheme.cmu.edu/blog/2019/02/12/Using-results-from-one-code-block-in-another-org-mode/

* Outputs
ref:
[[https://orgmode.org/manual/Results-of-Evaluation.html][Results of Org Bable When Evaluate]]

Note: I haven't read about it much (just yet), just writing notes on things that required some time for me to remembers if at all.

~:results value~ will output results from ~return~
~:results output~ will output results as if is is evaluated by python kernel.
* FAQs
** [[https://emacs.stackexchange.com/questions/34466/orgmode-babel-language-elisp-vs-emacs-lisp][orgmode - babel language elisp vs emacs-lisp]]
** how to prevent multiple output insertion?
=:cache yes= prevent multiple insertions.
